Revit 2027 API
RebarShapeMultiplanarDefinition.DepthParamId Property
 Id of the parameter driving the multiplanar depth. The depth is measured center-to-center of the bar. A valid shape parameter must be assigned to DepthParamId before the MultiplanarDefinition can be used in RebarShape creation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DepthParamId { get; set; }
Public Property DepthParamId As ElementId
	Get
	Set
public:
property ElementId^ DepthParamId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DepthParamId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace